# **Data Cleaning**
**Bad data could be:**

1. Wrong data
2. Data in wrong format
3. Duplicates
4. Empty cells/missing values
5. Outliers

In [3]:
import numpy as np
import pandas as pd

In [5]:
df = pd.DataFrame({"Age": [15,18,"18", 19.4,"20+"],
"Gender": ["male", "female", "female", "female", "male"]})

df

    Age  Gender
0    15    male
1    18  female
2    18  female
3  19.4  female
4   20+    male

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Age     5 non-null      object
 1   Gender  5 non-null      object
dtypes: object(2)
memory usage: 212.0+ bytes

In [5]:
# continous - float or int

# discrete count - int

# discrete categorical - object

In [4]:
df["Age"].unique()

array([15, 18, '18', 19.4, '20+'], dtype=object)

1) **Wrong Data**

- **Solution is Replace**

In [9]:
df["Age"] = df["Age"].replace({"20+":20})

df

    Age  Gender
0    15    male
1    18  female
2    18  female
3  19.4  female
4    20    male

In [9]:
df.dtypes  # Age will still show object because there is still a string '18'.

Age       object
Gender    object
dtype: object

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Age     5 non-null      object
 1   Gender  5 non-null      object
dtypes: object(2)
memory usage: 208.0+ bytes

 **2) Wrong Datatype**

- Solution: Convert the data type

In [11]:
df["Age"].astype('float')

0    15.0
1    18.0
2    18.0
3    19.4
4    20.0
Name: Age, dtype: float64

In [13]:
df["Age"] = df["Age"].astype('float')
df

    Age  Gender
0  15.0    male
1  18.0  female
2  18.0  female
3  19.4  female
4  20.0    male

In [14]:
df.dtypes

Age       float64
Gender     object
dtype: object

In [13]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Age     5 non-null      float64
 1   Gender  5 non-null      object
dtypes: float64(1), object(1)
memory usage: 208.0+ bytes

- **If we want the values to be replaced**

In [15]:
df["Age"] = df["Age"].replace({19.4:20,20:40})
df

    Age  Gender
0  15.0    male
1  18.0  female
2  18.0  female
3  20.0  female
4  40.0    male

- Remember the replace function replaces the values in multiple rows if present

In [17]:
df["Age"].replace({18:24})

0    15.0
1    24.0
2    24.0
3    20.0
4    40.0
Name: Age, dtype: float64

- If we want specific value even if it is present multiple times

In [19]:
df.iloc[2,0] = 24
df

    Age  Gender
0  15.0    male
1  18.0  female
2  24.0  female
3  20.0  female
4  40.0    male

In [21]:
df.iloc[[0,1,2],0] = [25,21,21]
df

    Age  Gender
0  25.0    male
1  21.0  female
2  21.0  female
3  20.0  female
4  40.0    male

# **3. Duplicates**

- Due to any data entry mistake : replace (collect orginal data)
- Solution: Remove

In [23]:
#to check the duplicated records
df.duplicated()

0    False
1    False
2     True
3    False
4    False
dtype: bool

In [25]:
#total no. of duplicates in given data
df.duplicated().sum()

1

In [27]:
#to extract duplicate records -- > df[condition]
df[df.duplicated()]

    Age  Gender
2  21.0  female

In [29]:
#to extract non duplicated records

df[~df.duplicated()]

    Age  Gender
0  25.0    male
1  21.0  female
3  20.0  female
4  40.0    male

In [31]:
df = df.drop_duplicates()

In [33]:
df

    Age  Gender
0  25.0    male
1  21.0  female
3  20.0  female
4  40.0    male

In [35]:
# to remove the duplictes
df = df.drop_duplicates(ignore_index = True)
df

    Age  Gender
0  25.0    male
1  21.0  female
2  20.0  female
3  40.0    male

# **Missing values**

- option 1 : drop/ remove the msissing values

  - Any column having >30% data as missing, drop that column

or

- option-2 : replace with original data (collect data frombackednd team)

or

- option-3 : replace statistically

   - continous : replace with mean (if no outliers)

   - continous : replace with median (if outliers)

   - discrete : replace with mode

- Solution: Either remove or replace

In [55]:
#percentage of missing values in each column

df.isnull().sum()/len(df)

Age       0.166667
Gender    0.333333
dtype: float64

In [ ]:
df = pd.read_excel(r"C:\Users\admin\Desktop\ex.xlsx")
df

In [37]:
df = pd.DataFrame({"Age": [15,np.nan, 24, 19, 20, 22],
"Gender":["male",np.nan, "female", "female",np.nan, "male"]})

df

    Age  Gender
0  15.0    male
1   NaN     NaN
2  24.0  female
3  19.0  female
4  20.0     NaN
5  22.0    male

In [39]:
# Option - 1
df.dropna()

    Age  Gender
0  15.0    male
2  24.0  female
3  19.0  female
5  22.0    male

In [45]:
df

    Age  Gender
0  15.0    male
1   NaN     NaN
2  24.0  female
3  19.0  female
4  20.0     NaN
5  22.0    male

In [47]:
df.fillna(20)        # TO fill the missing values

    Age  Gender
0  15.0    male
1  20.0      20
2  24.0  female
3  19.0  female
4  20.0      20
5  22.0    male

In [49]:
df["Age"].fillna(20)

0    15.0
1    20.0
2    24.0
3    19.0
4    20.0
5    22.0
Name: Age, dtype: float64

In [51]:
df["Gender"].fillna("male")

0      male
1      male
2    female
3    female
4      male
5      male
Name: Gender, dtype: object

In [41]:
# Option - 2
df.drop(index = [1,4])

    Age  Gender
0  15.0    male
2  24.0  female
3  19.0  female
5  22.0    male

In [43]:
df

    Age  Gender
0  15.0    male
1   NaN     NaN
2  24.0  female
3  19.0  female
4  20.0     NaN
5  22.0    male